{"class_name": "Sequential", "backend": "tensorflow", "config": {"layers": [{"class_name": "Embedding", "config": {"name": "embedding_2", "mask_zero": true, "embeddings_constraint": null, "embeddings_regularizer": null, "input_dim": 256, "batch_input_shape": [null, 50], "activity_regularizer": null, "dtype": "float32", "trainable": true, "input_length": 50, "output_dim": 100, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "seed": null, "dtype": "float32", "maxval": 0.05}}}}, {"class_name": "Bidirectional", "config": {"layer": {"class_name": "LSTM", "config": {"recurrent_activation": "hard_sigmoid", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "dtype": "float32", "gain": 1.0}}, "units": 256, "activation": "tanh", "bias_regularizer": null, "dropout": 0.15, "return_sequences": false, "name": "lstm_2", "kernel_regularizer": null, "stateful": false, "recurrent_constraint": null, "implementation": 1, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "recurrent_dropout": 0.15, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_constraint": null, "go_backwards": false, "dtype": null, "return_state": false, "activity_regularizer": null, "unroll": false, "recurrent_regularizer": null, "unit_forget_bias": true, "use_bias": true, "trainable": true}}, "dtype": "float32", "name": "bidirectional_2", "merge_mode": "sum", "trainable": true}}, {"class_name": "Dropout", "config": {"rate": 0.15, "noise_shape": null, "seed": null, "dtype": "float32", "name": "dropout_2", "trainable": true}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "units": 4, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_constraint": null, "activation": "softmax", "bias_regularizer": null, "activity_regularizer": null, "dtype": "float32", "name": "dense_2", "kernel_regularizer": null, "kernel_constraint": null, "use_bias": true, "trainable": true}}], "name": "sequential_2"}, "keras_version": "2.1.6-tf"}