{"config": {"name": "sequential_2", "layers": [{"config": {"mask_zero": false, "batch_input_shape": [null, 50], "name": "embedding_2", "input_dim": 128, "embeddings_initializer": {"config": {"seed": null, "maxval": 0.05, "dtype": "float32", "minval": -0.05}, "class_name": "RandomUniform"}, "output_dim": 100, "embeddings_regularizer": null, "dtype": "float32", "trainable": true, "input_length": 50, "embeddings_constraint": null, "activity_regularizer": null}, "class_name": "Embedding"}, {"config": {"name": "bidirectional_2", "layer": {"config": {"recurrent_constraint": null, "activation": "tanh", "implementation": 1, "bias_regularizer": null, "kernel_constraint": null, "recurrent_activation": "hard_sigmoid", "return_sequences": false, "dtype": null, "trainable": true, "stateful": false, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "units": 128, "kernel_regularizer": null, "recurrent_dropout": 0.15, "unit_forget_bias": true, "use_bias": true, "name": "lstm_2", "recurrent_regularizer": null, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0, "dtype": "float32"}, "class_name": "Orthogonal"}, "dropout": 0.15, "bias_constraint": null, "unroll": false, "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "return_state": false, "go_backwards": false, "activity_regularizer": null}, "class_name": "LSTM"}, "dtype": "float32", "merge_mode": "sum", "trainable": true}, "class_name": "Bidirectional"}, {"config": {"rate": 0.15, "noise_shape": null, "dtype": "float32", "trainable": true, "name": "dropout_2", "seed": null}, "class_name": "Dropout"}, {"config": {"kernel_regularizer": null, "dtype": "float32", "use_bias": true, "activation": "softmax", "name": "dense_2", "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "trainable": true, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "units": 4, "activity_regularizer": null}, "class_name": "Dense"}]}, "class_name": "Sequential", "keras_version": "2.1.6-tf", "backend": "tensorflow"}